; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	image1 - mode
	infrared2 - mode
	infrared0 - mode
	GroundStation1 - direction
	Star2 - direction
	Star0 - direction
	Planet3 - direction
	Star4 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Star18 - direction
	Planet19 - direction
	Star20 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image1)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star0)
	(supports instrument4 image1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star18)
	(supports instrument5 image1)
	(calibration_target instrument5 Star2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet15)
	(supports instrument6 image1)
	(supports instrument6 infrared0)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star0)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star2)
	(supports instrument8 infrared2)
	(supports instrument8 image1)
	(supports instrument8 infrared0)
	(calibration_target instrument8 Star0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star14)
	(supports instrument9 infrared0)
	(supports instrument9 infrared2)
	(calibration_target instrument9 Star0)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
)
(:goal (and
	(pointing satellite3 Planet8)
	(have_image Planet3 infrared2)
	(have_image Star4 image1)
	(have_image Planet5 infrared2)
	(have_image Star6 infrared2)
	(have_image Phenomenon7 image1)
	(have_image Planet8 image1)
	(have_image Star9 infrared0)
	(have_image Planet10 image1)
	(have_image Star11 infrared0)
	(have_image Planet12 image1)
	(have_image Planet13 infrared2)
	(have_image Star14 infrared2)
	(have_image Planet15 infrared2)
	(have_image Planet17 image1)
	(have_image Planet19 infrared2)
	(have_image Star20 infrared2)
))

)

; plan
1. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 0 of 17
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 17
3. (turn_to satellite4 planet13 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 planet13)
   goals met: 0 of 17
4. (turn_to satellite4 star0 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 star0)
   goals met: 0 of 17
5. (calibrate satellite4 instrument9 star0)
   added: (calibrated instrument9)
   goals met: 0 of 17
6. (turn_to satellite4 planet13 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 planet13)
   goals met: 0 of 17
7. (take_image satellite4 planet13 instrument9 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 1 of 17
8. (turn_to satellite4 planet15 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 planet15)
   goals met: 1 of 17
9. (take_image satellite4 planet15 instrument9 infrared2)
   added: (have_image planet15 infrared2)
   goals met: 2 of 17
10. (turn_to satellite4 planet19 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet19)
   goals met: 2 of 17
11. (take_image satellite4 planet19 instrument9 infrared2)
   added: (have_image planet19 infrared2)
   goals met: 3 of 17
12. (turn_to satellite4 planet3 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 planet3)
   goals met: 3 of 17
13. (take_image satellite4 planet3 instrument9 infrared2)
   added: (have_image planet3 infrared2)
   goals met: 4 of 17
14. (turn_to satellite4 planet5 planet3)
   deleted: (pointing satellite4 planet3)
   added: (pointing satellite4 planet5)
   goals met: 4 of 17
15. (take_image satellite4 planet5 instrument9 infrared2)
   added: (have_image planet5 infrared2)
   goals met: 5 of 17
16. (turn_to satellite4 star11 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 star11)
   goals met: 5 of 17
17. (take_image satellite4 star11 instrument9 infrared0)
   added: (have_image star11 infrared0)
   goals met: 6 of 17
18. (turn_to satellite4 star14 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 star14)
   goals met: 6 of 17
19. (take_image satellite4 star14 instrument9 infrared2)
   added: (have_image star14 infrared2)
   goals met: 7 of 17
20. (turn_to satellite4 star20 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 star20)
   goals met: 7 of 17
21. (take_image satellite4 star20 instrument9 infrared2)
   added: (have_image star20 infrared2)
   goals met: 8 of 17
22. (turn_to satellite4 star6 star20)
   deleted: (pointing satellite4 star20)
   added: (pointing satellite4 star6)
   goals met: 8 of 17
23. (take_image satellite4 star6 instrument9 infrared2)
   added: (have_image star6 infrared2)
   goals met: 9 of 17
24. (turn_to satellite4 star9 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 star9)
   goals met: 9 of 17
25. (take_image satellite4 star9 instrument9 infrared0)
   added: (have_image star9 infrared0)
   goals met: 10 of 17
26. (turn_to satellite3 planet8 star14)
   deleted: (pointing satellite3 star14)
   added: (pointing satellite3 planet8)
   goals met: 11 of 17
27. (turn_to satellite0 phenomenon7 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon7)
   goals met: 11 of 17
28. (turn_to satellite0 star2 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star2)
   goals met: 11 of 17
29. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 11 of 17
30. (turn_to satellite0 phenomenon7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon7)
   goals met: 11 of 17
31. (take_image satellite0 phenomenon7 instrument1 image1)
   added: (have_image phenomenon7 image1)
   goals met: 12 of 17
32. (turn_to satellite0 planet10 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet10)
   goals met: 12 of 17
33. (take_image satellite0 planet10 instrument1 image1)
   added: (have_image planet10 image1)
   goals met: 13 of 17
34. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 13 of 17
35. (take_image satellite0 planet12 instrument1 image1)
   added: (have_image planet12 image1)
   goals met: 14 of 17
36. (turn_to satellite0 planet17 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet17)
   goals met: 14 of 17
37. (take_image satellite0 planet17 instrument1 image1)
   added: (have_image planet17 image1)
   goals met: 15 of 17
38. (turn_to satellite0 planet8 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 planet8)
   goals met: 15 of 17
39. (take_image satellite0 planet8 instrument1 image1)
   added: (have_image planet8 image1)
   goals met: 16 of 17
40. (turn_to satellite0 star4 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star4)
   goals met: 16 of 17
41. (take_image satellite0 star4 instrument1 image1)
   added: (have_image star4 image1)
   goals met: 17 of 17
